# Dotfiles and shell configuration.
brew "chezmoi"
brew "git"
brew "gh"
brew "gnupg"
brew "pinentry-mac"
brew "starship"
brew "atuin"
brew "zoxide"
brew "eza"
brew "bat"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "fnm"
brew "pnpm"
brew "pyenv"
brew "openjdk@17"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "jq"

# Install Snyk
tap "snyk/tap"
brew "snyk/tap/snyk"

cask "1password-cli"

# Terminal and fonts.
cask "ghostty"
cask "font-fira-code-nerd-font"

# Open links in distinct browser profiles
cask "finicky"
